app/controllers/articles_controller.rb

    def create
      @article = Article.new(article_params)

      respond_to do |format|
        if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My Article Title"], ["body", "My Article Description"], ["created_at", "2019-10-30 00:54:25.571236"], ["updated_at", "2019-10-30 00:54:25.571236"]]

    def update
      respond_to do |format|
        if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My Updated Article Title"], ["body", "My Updated Article Description"], ["updated_at", "2019-10-30 00:54:44.668106"], ["id", 1]]